tutorials/lagrangian/reactingParcelFilmFoam/multipleBoxes/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

InjectionModel  ConeInjectionMP;

DragModel       SphereDrag;

DispersionModel none;

PatchInteractionModel StandardWallInteraction;

HeatTransferModel none; //RanzMarshall;

CompositionModel SinglePhaseMixture;

PhaseChangeModel none; // LiquidEvaporation;

PostProcessingModel none;

SurfaceFilmModel ThermoSurfaceFilm; // none;

radiation       off;

coupled         true;

cellValueSourceCorrection on;

parcelTypeId    1;

constantProperties
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 1e-15;
    TMin            TMin [ 0 0 0 1 0 ] 200;
    pMin            pMin [ 1 -1 2 0 0 ] 1000;
    rho0            rho0 [ 1 -3 0 0 0 ] 1000;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    T0              T0 [ 0 0 0 1 0 ] 300;
    cp0             cp0 [ 0 2 -2 -1 0 ] 4187;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
    Tvap            Tvap [ 0 0 0 1 0 ] 273;
    Tbp             Tvap [ 0 0 0 1 0 ] 373;
    constantVolume  false;
}

interpolationSchemes
{
    rho             cell;
    U               cell; // cellPointFace;
    mu              cell;
    T               cell;
    Cp              cell;
    p               cell;
}

integrationSchemes
{
    U               Euler;
    T               Analytical;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    pressureGradient off;
}

ConeInjectionCoeffs
{
    SOI             0.000;
    duration        10.000;
    position        (0.5 0.8 1.45);
    direction       (0 -0.5 -1);
    massTotal       massTotal [ 1 0 0 0 0 ] 0.025; // 1e-3;
    parcelsPerSecond 500;
    parcelBasisType mass;
    flowRateProfile constant 0.01;
    Umag            constant 5;
    thetaInner      constant 0;
    thetaOuter      constant 30;

    parcelPDF
    {
        pdfType         RosinRammler;
        RosinRammlerPDF
        {
            minValue        5e-04;
            maxValue        0.0012;
            d               7.5e-05;
            n               0.5;
        }
    }
}

ConeInjectionMPCoeffs
{                    
    SOI             0.000;
    duration        20.000;
    positionsFile   "reactingCloud1Positions";
    axesFile        "reactingCloud1Axes";     
    massTotal       massTotal [ 1 0 0 0 0 ] 10;
    parcelsPerInjector 20000;                                            
    parcelsPerSecond 500;                                                
    parcelBasisType mass;                                                
    flowRateProfile constant 0.1;                                        
    Umag            constant 3.0;                                        
    thetaInner      constant 0;                                          
    thetaOuter      constant 45;                                         

    parcelPDF                           
    {                                   
        pdfType         RosinRammler;   
        RosinRammlerPDF                 
        {                               
            minValue        5e-04;      
            maxValue        0.0012;     
            d               7.5e-05;
            n               0.5;    
        }                               
    }                                   

}


StandardWallInteractionCoeffs
{
    type            rebound;
}

RanzMarshallCoeffs
{
    BirdCorrection  false;
}

SinglePhaseMixtureCoeffs
{
    phases
    (
        liquid
        {
            H2O 1;
        }
    );
}

LiquidEvaporationCoeffs
{
    activeLiquids
    (
        H2O
    );
}

ThermoSurfaceFilmCoeffs
{}


// ************************************************************************* //
