tutorials/lagrangian/reactingParcelFilmFoam/multipleBoxes/Allrun-parallel
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

decomposePar -region wallFilmRegion >& log.decomposePar.wallFilmRegion
decomposePar >& log.decomposePar.primaryRegion

runParallel reactingParcelFilmFoam 4

reconstructPar -region wallFilmRegion >& log.reconstructPar.wallFilmRegion
reconstructPar >& log.reconstructPar.primaryRegion

